In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("sample_data.csv")

In [4]:
df.head()

,Name,Email,Phone,Address,City,Country,Date of Birth,Salary
0,Lisa West,andrew23@example.com,(465)852-8470,Unit 5183 Box 8914\nDPO AP 26775,Perezfort,Honduras,2001-08-05,83302.0
1,Jason Cole,kenneth05@example.net,7783540568,73784 Kenneth Stream Apt. 200\nFitzgeraldshire...,Port Andrea,Bolivia,2012-12-04,31035.0
2,Juan Crosby,zbarnes@example.org,(676)328-6244x05295,"0580 Mary Row\nLake Vanessabury, GA 81529",Johnborough,South Africa,1921-02-02,60226.0
3,April Ball,michaelmckinney@example.com,+1-633-685-4901x2113,"6215 Hensley Pass Apt. 136\nSouth Patricia, MN...",New Eric,Greece,2023-05-08,52502.0
4,Donald Jackson,peterdean@example.com,779-437-7643,"156 Macdonald Alley\nWest Scottmouth, MA 82872",Alyssaborough,Namibia,2019-03-07,38687.0

In [6]:
df.isnull().count()

Name             200
Email            200
Phone            200
Address          200
City             200
Country          200
Date of Birth    200
Salary           200
dtype: int64

In [7]:
df.describe

<bound method NDFrame.describe of                   Name                        Email                 Phone  \
0            Lisa West         andrew23@example.com         (465)852-8470
1           Jason Cole        kenneth05@example.net            7783540568
2          Juan Crosby          zbarnes@example.org   (676)328-6244x05295
3           April Ball  michaelmckinney@example.com  +1-633-685-4901x2113
4       Donald Jackson        peterdean@example.com          779-437-7643
..                 ...                          ...                   ...
195     Willie Shelton       jamesdavis@example.net      277-426-9077x821
196  Deborah Nicholson       michelle15@example.net     954-765-9968x1900
197         Vanessa Wu    reginaldowens@example.com  +1-682-798-1566x9050
198        Robyn Allen           chad33@example.org      212-239-3934x599
199      Scott Stewart        valerie39@example.com          956.897.0540

                                               Address           City  \
0                     Unit 5183 Box 8914\nDPO AP 26775      Perezfort
1    73784 Kenneth Stream Apt. 200\nFitzgeraldshire...    Port Andrea
2            0580 Mary Row\nLake Vanessabury, GA 81529    Johnborough
3    6215 Hensley Pass Apt. 136\nSouth Patricia, MN...       New Eric
4       156 Macdonald Alley\nWest Scottmouth, MA 82872  Alyssaborough
..                                                 ...            ...
195         2277 Kathryn Cliffs\nDanielshire, VI 89502   East Michael
196    3179 Young Brooks Apt. 868\nScottberg, MI 16700     Port Linda
197        1820 Denise Forks\nEast Katieberg, IL 88289  Cassandraview
198  1162 Kathryn Extensions\nEast Larryfurt, MP 70273      Bruceberg
199              228 Adrian Pine\nNorth Sean, IL 20499  Alexandraside

          Country Date of Birth   Salary
0        Honduras    2001-08-05  83302.0
1         Bolivia    2012-12-04  31035.0
2    South Africa    1921-02-02  60226.0
3          Greece    2023-05-08  52502.0
4         Namibia    2019-03-07  38687.0
..            ...           ...      ...
195      Mongolia    2017-05-20  59788.0
196       Senegal    1963-07-25  61230.0
197        Israel    1929-01-18  70482.0
198          Iran    1941-05-17  73249.0
199   New Zealand    2019-09-30  81174.0

[200 rows x 8 columns]>

In [8]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
195     True
196     True
197     True
198     True
199     True
Length: 200, dtype: bool

In [9]:
df.shape

(200, 8)